[
    {
        "title":"Beginnings",
        "year":"14/04/2021 - 31/10/2022",
        "desc":"I pursued my studies in software development at the 'Centro Agropecuario de Buga' of SENA, successfully completing the technological career. This experience provided me with a solid foundation in programming skills and software development, as well as a profound understanding of fundamental principles in the technological field.",
        "role":"Student"
    },
    {
        "title":"Internships",
        "year":"08/11/2022 - 08/05/2023",
        "desc":"After completing my degree, I undertook an internship as a backend developer at the 'Centro Agropecuario de Buga' of SENA. During this experience, I was able to apply and expand upon the knowledge gained in my degree, working in the practical environment of backend development and contributing to the team with my technical skills.",
        "role":"Intern"
    },
    {
        "title":"Junior job",
        "year":"22/09/2023 - 31/12/2023",
        "desc":"I played a fundamental role in the comprehensive development of the landing page for SATIC (Intelligent and Community Early Warning System), where I contributed with creativity and technical skills to ensure an attractive and functional presentation. Additionally, I actively participated in the design and implementation of several key modules in the application's dashboard, providing innovative solutions that improved the user experience and system efficiency.",
        "role":"Service provider"
    },
    {
        "title":"Freelance",
        "year":"19-02-2024 - 26-02-2024",
        "desc":"The Megatech landing page, developed using ReactJS, presents the company as a leader in innovative technological solutions. It highlights services such as custom software development, technology consulting, and IT infrastructure solutions. The page focuses on values like integrity, collaboration, and innovation, backed by testimonials from satisfied customers. The contact form allows visitors to easily connect for more information or to request services. An intuitive and attractive page that reflects Megatech's commitment to excellence in technology.",
        "role":"Frontend Developer"
    },
    {
        "title":"Freelance",
        "year":"31/10/2023 - Present",
        "desc":"Currently, I'm the Project Manager of the development team at Nostalhit, a music distributor. In this role, I lead and manage projects, ensuring the efficient execution of the development team to achieve the company's objectives in the music industry.",
        "role":"Project Manager"
    }    
]